Ran Plan for 3 projects:

1. project: `platform` dir: `2.platform` workspace: `default`
1. project: `data-prod` dir: `3.data` workspace: `prod`
1. project: `data-staging` dir: `3.data` workspace: `staging`

### 1. project: `platform` dir: `2.platform` workspace: `default`
**Plan Error**
```
running "/atlantis-data/bin/terraform1.6.6 plan -input=false -refresh -out \"/atlantis-data/repos/wangzitian0/infra/206/default/2.platform/platform-default.tfplan\"" in "/atlantis-data/repos/wangzitian0/infra/206/default/2.platform": exit status 1
╷
│ Error: failed to read schema for random_password.l3_redis in registry.terraform.io/hashicorp/random: failed to instantiate provider "registry.terraform.io/hashicorp/random" to obtain schema: fork/exec .terraform/providers/registry.terraform.io/hashicorp/random/3.7.2/linux_amd64/terraform-provider-random_v3.7.2_x5: text file busy
│ 
│ 
╵

```

---
### 2. project: `data-prod` dir: `3.data` workspace: `prod`
**Plan Error**
```
running "/atlantis-data/bin/terraform1.6.6 workspace new prod" in "/atlantis-data/repos/wangzitian0/infra/206/prod/3.data": exit status 1: Workspace "prod" already exists

=== TF_VAR Debug ===
TF_VAR_vault_root_token length: 28
TF_VAR_vault_root_token is SET

```

---
### 3. project: `data-staging` dir: `3.data` workspace: `staging`
<details><summary>Show Output</summary>

```diff
=== TF_VAR Debug ===
TF_VAR_vault_root_token length: 28
TF_VAR_vault_root_token is SET


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # kubectl_manifest.arangodb_deployment will be created
+ resource "kubectl_manifest" "arangodb_deployment" {
      + api_version             = "database.arangodb.com/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ArangoDeployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "arangodb"
      + namespace               = "data-staging"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: database.arangodb.com/v1
            kind: ArangoDeployment
            metadata:
              name: arangodb
              namespace: data-staging
            spec:
              auth:
                jwtSecretName: arangodb-jwt
              image: arangodb/arangodb:3.11.8
              mode: Single
              single:
                count: 1
                resources:
                  limits:
                    cpu: 500m
                    memory: 512Mi
                  requests:
                    cpu: 100m
                    memory: 128Mi
                volumeClaimTemplate:
                  spec:
                    accessModes:
                    - ReadWriteOnce
                    resources:
                      requests:
                        storage: 5Gi
                    storageClassName: local-path-retain
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p data-staging`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F3.data%252Fstaging)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p data-staging`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`